# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO12 object detection model with P2/4 - P4/16 outputs
# Model docs: https://docs.ultralytics.com/models/yolo12
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo12n.yaml' will call yolo12.yaml with scale 'n'
  # [depth, width, max_channels]
  s: [0.50, 0.50, 1024] # summary: Using 0.50 to ensure channels are multiples of 64 (for ABlock compatibility)

# YOLO12n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C3k2, [256, False, 0.25]] # Increased repeats from 2 to 3
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 3, C3k2, [512, False, 0.25]] # Increased repeats from 2 to 3
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 5, A2C2f, [512, True, 4]] # 6 - Increased repeats from 4 to 5
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 5, A2C2f, [1024, True, 1]] # 8 - Increased repeats from 4 to 5

# YOLO12n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 4, A2C2f, [512, False, 1, False, 2.0, 0.5]] # 10 - c2=512, e=0.5 -> c_=256 (multiple of 32) ✓

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 4, A2C2f, [256, False, 1, False, 2.0, 0.5]] # 14 - c2=256, e=0.5 -> c_=128 (multiple of 32) ✓

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 1], 1, Concat, [1]] # cat backbone P2
  - [-1, 4, A2C2f, [128, False, 1, False, 2.0, 0.5]] # 17 - c2=128, e=0.5 -> c_=64 (multiple of 32) ✓

  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 14], 1, Concat, [1]] # cat head P3
  - [-1, 4, A2C2f, [256, False, 1, False, 2.0, 0.5]] # 19 - c2=256, e=0.5 -> c_=128 (multiple of 32) ✓

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 10], 1, Concat, [1]] # cat head P4
  - [-1, 2, C3k2, [512, True]] # 22 - Using C3k2 for final bottom-up layer (P4/16-large) like obb/seg pattern

  - [[17, 19, 22], 1, Detect, [nc]] # Detect(P2, P3, P4)
  # Improved architecture for higher mAP
