# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO12 object detection model with P2/4 - P4/16 outputs - EXTREME OPTIMIZATION
# Model docs: https://docs.ultralytics.com/models/yolo12
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo12n.yaml' will call yolo12.yaml with scale 'n'
  # [depth, width, max_channels]
  s: [0.50, 0.50, 1024] # Optimized for extreme performance

# YOLO12s backbone - EXTREME OPTIMIZATION
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 4, C3k2, [256, False, 0.25]] # Optimized: Increased repeats for better feature extraction
  - [-1, 1, ADown, [256]] # 3-P3/8 - Using ADown for efficient downsampling
  - [-1, 4, C3k2, [512, False, 0.25]] # Optimized: Increased repeats
  - [-1, 1, ADown, [512]] # 5-P4/16 - Using ADown for efficient downsampling
  - [-1, 6, A2C2f, [512, True, 4]] # 6 - Optimized: Increased repeats for better attention
  - [-1, 1, ADown, [1024]] # 7-P5/32 - Using ADown for efficient downsampling
  - [-1, 6, A2C2f, [1024, True, 1]] # 8 - Optimized: Increased repeats
  - [-1, 1, SPPF, [1024, 5]] # 9 - Added SPPF for multi-scale feature extraction

# YOLO12s head - EXTREME OPTIMIZATION
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 5, A2C2f, [512, False, -1]] # 12 - Optimized: Increased repeats

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 5, A2C2f, [256, False, -1]] # 15 - Optimized: Increased repeats

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 1], 1, Concat, [1]] # cat backbone P2
  - [-1, 5, A2C2f, [128, False, -1]] # 18 - Optimized: Increased repeats

  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 15], 1, Concat, [1]] # cat head P3
  - [-1, 5, A2C2f, [256, False, -1]] # 21 - Optimized: Increased repeats

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]] # cat head P4
  - [-1, 3, C3k2, [512, True]] # 24 - Optimized: Using C3k2 for final bottom-up layer

  - [[18, 21, 24], 1, Detect, [nc]] # Detect(P2, P3, P4)
  # Extreme optimization: Enhanced backbone with ADown, SPPF, optimized A2C2f with residual connections
  # Improved feature extraction and multi-scale processing for maximum performance
